Instalar libreria necesaria

In [4]:
%pip install pyodbc

Collecting pyodbc
  Downloading pyodbc-5.2.0-cp312-cp312-win_amd64.whl.metadata (2.8 kB)
Downloading pyodbc-5.2.0-cp312-cp312-win_amd64.whl (69 kB)
Installing collected packages: pyodbc
Successfully installed pyodbc-5.2.0
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.2 -> 24.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

Importar librerias

In [33]:
import pyodbc
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import json

In [34]:
#Desactivar warnings

import warnings
warnings.filterwarnings('ignore')

Conectar a la base de datos en SQL Server

In [45]:
server = 'NOELIA'
database = 'Airline'
driver = 'ODBC Driver 17 for SQL Server'

conn_str = f'DRIVER={{{driver}}}; SERVER={server};DATABASE={database};Trusted_Connection=yes;'
connection= pyodbc.connect(conn_str)
cursor = connection.cursor()
print (cursor)

<pyodbc.Cursor object at 0x000001E73279EC30>

Consulto un listado de las tablas disponibles

In [46]:
cursor.execute("SELECT TABLE_NAME FROM INFORMATION_SCHEMA.TABLES WHERE TABLE_TYPE = 'BASE TABLE';")
tables = cursor.fetchall()
    
print("Tablas disponibles en la base de datos:")
for table in tables:
    print(table[0])

Tablas disponibles en la base de datos:
aircrafts_data
tickets
ticket_flights
seats
bookings
flights
boarding_passes
airports_data
sysdiagrams

Exploramos las tablas:

In [36]:
query = "SELECT TOP 20 * FROM aircrafts_data;"

aircrafts_data = pd.read_sql_query(query, connection)
aircrafts_data

  aircraft_code                                              model  range
0           773    {"en": "Boeing 777-300", "ru": "Боинг 777-300"}  11100
1           763    {"en": "Boeing 767-300", "ru": "Боинг 767-300"}   7900
2           SU9  {"en": "Sukhoi Superjet-100", "ru": "Сухой Суп...   3000
3           320  {"en": "Airbus A320-200", "ru": "Аэробус A320-...   5700
4           321  {"en": "Airbus A321-200", "ru": "Аэробус A321-...   5600
5           319  {"en": "Airbus A319-100", "ru": "Аэробус A319-...   6700
6           733    {"en": "Boeing 737-300", "ru": "Боинг 737-300"}   4200
7           CN1  {"en": "Cessna 208 Caravan", "ru": "Сессна 208...   1200
8           CR2  {"en": "Bombardier CRJ-200", "ru": "Бомбардье ...   2700

In [37]:
query = "SELECT TOP 20 * FROM airports_data;"

airports_data = pd.read_sql_query(query, connection)
airports_data

,airport_code,airport_name,city,coordinates,timezone
0,YKS,"{""en"": ""Yakutsk Airport"", ""ru"": ""Якутск""}","{""en"": ""Yakutsk"", ""ru"": ""Якутск""}","(129.77099609375,62.0932998657226562)",Asia/Yakutsk
1,MJZ,"{""en"": ""Mirny Airport"", ""ru"": ""Мирный""}","{""en"": ""Mirnyj"", ""ru"": ""Мирный""}","(114.03900146484375,62.534698486328125)",Asia/Yakutsk
2,KHV,"{""en"": ""Khabarovsk-Novy Airport"", ""ru"": ""Хабар...","{""en"": ""Khabarovsk"", ""ru"": ""Хабаровск""}","(135.18800354004,48.5279998779300001)",Asia/Vladivostok
3,PKC,"{""en"": ""Yelizovo Airport"", ""ru"": ""Елизово""}","{""en"": ""Petropavlovsk"", ""ru"": ""Петропавловск-К...","(158.453994750976562,53.1679000854492188)",Asia/Kamchatka
4,UUS,"{""en"": ""Yuzhno-Sakhalinsk Airport"", ""ru"": ""Хом...","{""en"": ""Yuzhno-Sakhalinsk"", ""ru"": ""Южно-Сахали...","(142.718002319335938,46.8886985778808594)",Asia/Sakhalin
5,VVO,"{""en"": ""Vladivostok International Airport"", ""r...","{""en"": ""Vladivostok"", ""ru"": ""Владивосток""}","(132.147994995117188,43.3989982604980469)",Asia/Vladivostok
6,LED,"{""en"": ""Pulkovo Airport"", ""ru"": ""Пулково""}","{""en"": ""St. Petersburg"", ""ru"": ""Санкт-Петербург""}","(30.2625007629394531,59.8003005981445312)",Europe/Moscow
7,KGD,"{""en"": ""Khrabrovo Airport"", ""ru"": ""Храброво""}","{""en"": ""Kaliningrad"", ""ru"": ""Калининград""}","(20.5925998687744141,54.8899993896484375)",Europe/Kaliningrad
8,KEJ,"{""en"": ""Kemerovo Airport"", ""ru"": ""Кемерово""}","{""en"": ""Kemorovo"", ""ru"": ""Кемерово""}","(86.1072006225585938,55.2700996398925781)",Asia/Novokuznetsk
9,CEK,"{""en"": ""Chelyabinsk Balandino Airport"", ""ru"": ...","{""en"": ""Chelyabinsk"", ""ru"": ""Челябинск""}","(61.503300000000003,55.3058010000000024)",Asia/Yekaterinburg
10,MQF,"{""en"": ""Magnitogorsk International Airport"", ""...","{""en"": ""Magnetiogorsk"", ""ru"": ""Магнитогорск""}","(58.7556991577148438,53.3931007385253906)",Asia/Yekaterinburg
11,PEE,"{""en"": ""Bolshoye Savino Airport"", ""ru"": ""Пермь""}","{""en"": ""Perm"", ""ru"": ""Пермь""}","(56.021198272705,57.9145011901860016)",Asia/Yekaterinburg
12,SGC,"{""en"": ""Surgut Airport"", ""ru"": ""Сургут""}","{""en"": ""Surgut"", ""ru"": ""Сургут""}","(73.4018020629882812,61.3437004089355469)",Asia/Yekaterinburg
13,BZK,"{""en"": ""Bryansk Airport"", ""ru"": ""Брянск""}","{""en"": ""Bryansk"", ""ru"": ""Брянск""}","(34.1763992309999978,53.2141990661999955)",Europe/Moscow
14,MRV,"{""en"": ""Mineralnyye Vody Airport"", ""ru"": ""Мине...","{""en"": ""Mineralnye Vody"", ""ru"": ""Минеральные В...","(43.0819015502929688,44.2251014709472656)",Europe/Moscow
15,STW,"{""en"": ""Stavropol Shpakovskoye Airport"", ""ru"":...","{""en"": ""Stavropol"", ""ru"": ""Ставрополь""}","(42.1128005981445312,45.1091995239257812)",Europe/Moscow
16,ASF,"{""en"": ""Astrakhan Airport"", ""ru"": ""Астрахань""}","{""en"": ""Astrakhan"", ""ru"": ""Астрахань""}","(48.0063018799000005,46.2832984924000002)",Europe/Samara
17,NJC,"{""en"": ""Nizhnevartovsk Airport"", ""ru"": ""Нижнев...","{""en"": ""Nizhnevartovsk"", ""ru"": ""Нижневартовск""}","(76.4835968017578125,60.9492988586425781)",Asia/Yekaterinburg
18,SVX,"{""en"": ""Koltsovo Airport"", ""ru"": ""Кольцово""}","{""en"": ""Yekaterinburg"", ""ru"": ""Екатеринбург""}","(60.8027000427250002,56.7430992126460012)",Asia/Yekaterinburg
19,SVO,"{""en"": ""Sheremetyevo International Airport"", ""...","{""en"": ""Moscow"", ""ru"": ""Москва""}","(37.4146000000000001,55.9725990000000024)",Europe/Moscow

In [38]:
query = "SELECT TOP 20 * FROM boarding_passes;"

boarding_passes = pd.read_sql_query(query, connection)
boarding_passes

        ticket_no  flight_id  boarding_no seat_no
0   0005435212351      30625            1      2D
1   0005435212386      30625            2      3G
2   0005435212381      30625            3      4H
3   0005432211370      30625            4      5D
4   0005435212357      30625            5     11A
5   0005435212360      30625            6     11E
6   0005435212393      30625            7     11H
7   0005435212374      30625            8     12E
8   0005435212365      30625            9     13D
9   0005435212378      30625           10     14H
10  0005435212362      30625           11     15E
11  0005435212334      30625           12     15F
12  0005435212370      30625           13     15K
13  0005435212329      30625           14     15H
14  0005435725513      30625           15     16D
15  0005435212328      30625           16     16C
16  0005435630915      30625           17     16E
17  0005435212388      30625           18     17E
18  0005432159775      30625           19     17D
19  0005435212382      30625           20     17H

In [39]:
query = "SELECT TOP 20 * FROM bookings;"

bookings = pd.read_sql_query(query, connection)
bookings

   book_ref               book_date  total_amount
0    00000F 2017-07-05 03:12:00.030        265700
1    000012 2017-07-14 09:02:00.030         37900
2    000068 2017-08-15 14:27:00.030         18100
3    000181 2017-08-10 13:28:00.030        131800
4    0002D8 2017-08-07 21:40:00.030         23600
5    0002DB 2017-07-29 06:30:00.030        101500
6    0002E0 2017-07-11 16:09:00.030         89600
7    0002F3 2017-07-10 05:31:00.030         69600
8    00034E 2017-08-04 16:52:00.030         73300
9    000352 2017-07-06 02:02:00.030        109500
10   000374 2017-08-12 10:13:00.030        136200
11   00044D 2017-07-30 00:24:00.030          6000
12   00044E 2017-07-17 05:39:00.030        140100
13   0004B0 2017-07-28 09:00:00.030         12000
14   0004E1 2017-07-31 17:34:00.030        139300
15   000511 2017-07-01 03:40:00.030         26700
16   00053F 2017-08-06 03:15:00.030          6000
17   00054E 2017-07-15 10:54:00.030         50700
18   0005E7 2017-07-03 09:25:00.030         28800
19   0005F4 2017-08-09 02:14:00.030         95400

In [40]:
query = "SELECT TOP 20 * FROM flights;"

flights = pd.read_sql_query(query, connection)
flights

,flight_id,flight_no,scheduled_departure,scheduled_arrival,departure_airport,arrival_airport,status,aircraft_code,actual_departure,actual_arrival
0,1185,PG0134,2017-09-10 09:50:00.030,2017-09-10 14:55:00.030,DME,BTK,Scheduled,319,\N,\N
1,3979,PG0052,2017-08-25 14:50:00.030,2017-08-25 17:35:00.030,VKO,HMA,Scheduled,CR2,\N,\N
2,4739,PG0561,2017-09-05 12:30:00.030,2017-09-05 14:15:00.030,VKO,AER,Scheduled,763,\N,\N
3,5502,PG0529,2017-09-12 09:50:00.030,2017-09-12 11:20:00.030,SVO,UFA,Scheduled,763,\N,\N
4,6938,PG0461,2017-09-04 12:25:00.030,2017-09-04 13:20:00.030,SVO,ULV,Scheduled,SU9,\N,\N
5,7784,PG0667,2017-09-10 15:00:00.030,2017-09-10 17:30:00.030,SVO,KRO,Scheduled,CR2,\N,\N
6,9478,PG0360,2017-08-28 09:00:00.030,2017-08-28 11:35:00.030,LED,REN,Scheduled,CR2,\N,\N
7,11085,PG0569,2017-08-24 15:05:00.030,2017-08-24 16:10:00.030,SVX,SCW,Scheduled,733,\N,\N
8,11847,PG0498,2017-09-12 10:15:00.030,2017-09-12 14:55:00.030,KZN,IKT,Scheduled,319,\N,\N
9,12012,PG0621,2017-08-26 16:05:00.030,2017-08-26 17:00:00.030,KZN,MQF,Scheduled,CR2,\N,\N
10,13113,PG0612,2017-08-18 16:25:00.030,2017-08-18 20:05:00.030,ROV,KZN,Scheduled,CN1,\N,\N
11,14806,PG0676,2017-09-06 07:05:00.030,2017-09-06 07:45:00.030,PEE,CEK,Scheduled,CR2,\N,\N
12,16837,PG0010,2017-09-05 12:25:00.030,2017-09-05 14:35:00.030,JOK,VKO,Scheduled,CN1,\N,\N
13,17173,PG0059,2017-09-14 12:25:00.030,2017-09-14 14:45:00.030,SCW,NBC,Cancelled,CN1,\N,\N
14,19807,PG0035,2017-09-11 06:35:00.030,2017-09-11 09:25:00.030,MJZ,CNN,Scheduled,CN1,\N,\N
15,23609,PG0648,2017-08-31 11:35:00.030,2017-08-31 13:00:00.030,UUA,SVO,Scheduled,CR2,\N,\N
16,23695,PG0388,2017-08-26 10:55:00.030,2017-08-26 11:25:00.030,UUA,REN,Scheduled,CR2,\N,\N
17,23780,PG0098,2017-09-02 06:50:00.030,2017-09-02 10:30:00.030,SWT,CEK,Scheduled,CN1,\N,\N
18,23945,PG0076,2017-09-05 09:15:00.030,2017-09-05 11:50:00.030,EYK,DME,Scheduled,CR2,\N,\N
19,24705,PG0632,2017-08-26 15:00:00.030,2017-08-26 17:35:00.030,TJM,PES,Scheduled,CR2,\N,\N

In [41]:
query = "SELECT TOP 20 * FROM seats;"

seats = pd.read_sql_query(query, connection)
seats

   aircraft_code seat_no fare_conditions
0            319      2A        Business
1            319      2C        Business
2            319      2D        Business
3            319      2F        Business
4            319      3A        Business
5            319      3C        Business
6            319      3D        Business
7            319      3F        Business
8            319      4A        Business
9            319      4C        Business
10           319      4D        Business
11           319      4F        Business
12           319      5A        Business
13           319      5C        Business
14           319      5D        Business
15           319      5F        Business
16           319      6A         Economy
17           319      6B         Economy
18           319      6C         Economy
19           319      6D         Economy

In [42]:
query = "SELECT TOP 20 * FROM ticket_flights;"

ticket_flights = pd.read_sql_query(query, connection)
ticket_flights

     ticket_no  flight_id fare_conditions  amount
0   5432159776      30625        Business   42100
1   5435212351      30625        Business   42100
2   5435212386      30625        Business   42100
3   5435212381      30625        Business   42100
4   5432211370      30625        Business   42100
5   5435212357      30625         Comfort   23900
6   5435212360      30625         Comfort   23900
7   5435212393      30625         Comfort   23900
8   5435212374      30625         Comfort   23900
9   5435212365      30625         Comfort   23900
10  5435212378      30625         Comfort   23900
11  5435212362      30625         Comfort   23900
12  5435212334      30625         Comfort   23900
13  5435212329      30625         Comfort   23900
14  5435212370      30625         Comfort   23900
15  5435212328      30625         Comfort   23900
16  5435725513      30625         Comfort   23900
17  5435630915      30625         Comfort   23900
18  5435212388      30625         Economy   14000
19  5432159775      30625         Economy   14000

In [43]:
query = "SELECT TOP 20 * FROM tickets;"

tickets = pd.read_sql_query(query, connection)
tickets

     ticket_no book_ref passenger_id
0   5432000987   06B046  8149 604011
1   5432000988   06B046  8499 420203
2   5432000989   E170C3  1011 752484
3   5432000990   E170C3  4849 400049
4   5432000991   F313DD  6615 976589
5   5432000992   F313DD  2021 652719
6   5432000993   F313DD  0817 363231
7   5432000994   CCC5CB  2883 989356
8   5432000995   CCC5CB  3097 995546
9   5432000996   1FB1E4  6866 920231
10  5432000997   DE3EA6  6030 369450
11  5432000998   4B75D1  8675 588663
12  5432000999   9E60AA  0764 728785
13  5432001000   69DAD1  8954 972101
14  5432001001   69DAD1  6772 748756
15  5432001002   69DAD1  7364 216524
16  5432001003   08A2A5  3635 182357
17  5432001004   08A2A5  8252 507584
18  5432001005   C2CAB7  1026 982766
19  5432001006   C6DA66  7107 950192

Cerrar la conexion

In [44]:
cursor.close()
connection.close()